## Terraform Plan
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                 NAME                                                  |
|--------|-------------------------------------------------------------------------------------------------------|
| add    | `module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai`                             |
|        | `module.platform_core_hackathon_api_key.azurerm_cognitive_deployment.deployment[&quot;gpt-4o&quot;]`            |
|        | `module.platform_core_hackathon_api_key.azurerm_cognitive_deployment.deployment[&quot;openai-gpt4o-mini&quot;]` |
|        | `module.platform_core_hackathon_api_key.azurerm_consumption_budget_resource_group.openai_budget`      |
|        | `module.platform_core_hackathon_api_key.azurerm_resource_group.rg`                                    |
|        | `module.platform_core_hackathon_api_key.random_string.azurerm_cognitive_account_name`                 |
| update | `module.ai_answers_api_key.azurerm_cognitive_deployment.deployment[&quot;gpt-4o&quot;]`                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.ai_answers_api_key.azurerm_cognitive_deployment.deployment["gpt-4o"] will be updated in-place
  ~ resource "azurerm_cognitive_deployment" "deployment" {
        id                         = "/subscriptions/5617b0eb-50cc-4fe6-b57e-021e6ec245f0/resourceGroups/nimwzfg-ai-answers/providers/Microsoft.CognitiveServices/accounts/ai-answers-nimwzfg/deployments/gpt-4o"
        name                       = "gpt-4o"
      - rai_policy_name            = "Microsoft.DefaultV2" -> null
        # (3 unchanged attributes hidden)

      ~ sku {
          ~ capacity = 218 -> 50
            name     = "GlobalStandard"
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai will be created
  + resource "azurerm_cognitive_account" "openai" {
      + custom_subdomain_name              = (known after apply)
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "OpenAI"
      + local_auth_enabled                 = true
      + location                           = "canadaeast"
      + name                               = (known after apply)
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = (known after apply)
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "S0"
      + tags                               = {
          + "division" = "CDS"
        }
    }

  # module.platform_core_hackathon_api_key.azurerm_cognitive_deployment.deployment["gpt-4o"] will be created
  + resource "azurerm_cognitive_deployment" "deployment" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "gpt-4o"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4o"
          + version = "2024-11-20"
        }

      + sku {
          + capacity = 50
          + name     = "GlobalStandard"
        }
    }

  # module.platform_core_hackathon_api_key.azurerm_cognitive_deployment.deployment["openai-gpt4o-mini"] will be created
  + resource "azurerm_cognitive_deployment" "deployment" {
      + cognitive_account_id   = (known after apply)
      + id                     = (known after apply)
      + name                   = "openai-gpt4o-mini"
      + version_upgrade_option = "OnceNewDefaultVersionAvailable"

      + model {
          + format  = "OpenAI"
          + name    = "gpt-4o-mini"
          + version = "2024-07-18"
        }

      + sku {
          + capacity = 50
          + name     = "GlobalStandard"
        }
    }

  # module.platform_core_hackathon_api_key.azurerm_consumption_budget_resource_group.openai_budget will be created
  + resource "azurerm_consumption_budget_resource_group" "openai_budget" {
      + amount            = 50
      + etag              = (known after apply)
      + id                = (known after apply)
      + name              = "openai-budget"
      + resource_group_id = (known after apply)
      + time_grain        = "Monthly"

      + notification {
          + contact_emails = [
              + "sre-ifs@cds-snc.ca",
              + "platform-core-services@cds-snc.ca",
            ]
          + contact_groups = []
          + contact_roles  = []
          + enabled        = true
          + operator       = "EqualTo"
          + threshold      = 80
          + threshold_type = "Forecasted"
        }

      + time_period {
          + end_date   = "2035-02-01T00:00:00Z"
          + start_date = "2025-02-01T00:00:00Z"
        }
    }

  # module.platform_core_hackathon_api_key.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "canadaeast"
      + name     = (known after apply)
    }

  # module.platform_core_hackathon_api_key.random_string.azurerm_cognitive_account_name will be created
  + resource "random_string" "azurerm_cognitive_account_name" {
      + id          = (known after apply)
      + length      = 7
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + numeric     = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 6 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.ai_answers_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.platform_core_hackathon_api_key.azurerm_resource_group.rg"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_application.sp_app[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_app_service_principal.azuread_service_principal.sp[0]"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_cognitive_account.openai"]
WARN - plan.json - main - Missing Common Tags: ["module.valentine_api_key.azurerm_resource_group.rg"]

27 tests, 19 passed, 8 warnings, 0 failures, 0 exceptions

```

</details>
